[
	{
		"company": "Knowledge Foundry",
		"role": "Senior Data Scientist",
		"start": "2021-10",
		"end": "Present",
		"summary": "Leading delivery of generative AI, predictive modeling, and scalable ML systems across industrial automation, insurance, and media analytics; mentoring team members and aligning technical outputs with business impact.",
		"projects": [
			{
				"name": "GenAI-Powered RFQ Summarization (Fortune 500 Industrial Automation Client)",
				"bullets": [
					"Designed & deployed an end-to-end Retrieval-Augmented Generation (RAG) workflow on Azure using Python + LLMs to summarize complex RFQs.",
					"Engineered document chunking, hybrid embedding retrieval, and relevance re-ranking to reach ~90% retrieval accuracy.",
					"Reduced manual bid team review effort by ~70% through automated structured summaries and key value extraction.",
					"Iteratively refined prompt strategy with bid stakeholders to align outputs with deal qualification criteria."
				],
				"impact": "Accelerated bid qualification and improved prioritization of high-value RFQs.",
				"tech": ["Python", "Azure OpenAI", "RAG", "Vector Embeddings", "LLM Prompt Engineering", "Azure Cognitive Search"]
			},
			{
				"name": "Scalable ML for U.S. Insurance CRM",
				"bullets": [
					"Built enterprise-scale predictive models (propensity, cross-sell, churn risk) using Python & scikit-learn on AWS.",
					"Implemented NLP-driven enrichment of agent/customer interaction logs for behavioral segmentation.",
					"Led a team of 5; translated model outputs into CRM playbooks in partnership with sales operations.",
					"Integrated automated retraining & monitoring (data drift + performance) to maintain reliability."
				],
				"impact": "Improved deal closure rates by ~40% and enhanced CRM agent targeting precision.",
				"tech": ["Python", "scikit-learn", "AWS", "NLP", "Airflow (orchestration)", "Model Monitoring"]
			},
			{
				"name": "Video Content Optimization (US-Based AI Startup)",
				"bullets": [
					"Developed OpenCV + GenAI pipeline for sermon video segmentation: speaker tracking, frame stabilization, and caption embedding.",
					"Automated generation of short-form, platform-ready reels for social media distribution.",
					"Optimized processing to reduce manual editing cycles for content teams."
				],
				"impact": "Accelerated production of social media-ready video clips; enabled scalable content repurposing.",
				"tech": ["Python", "OpenCV", "Generative AI", "FFmpeg", "Captioning Pipelines"]
			}
		],
		"tech": ["Python", "LLMs", "RAG", "Azure", "AWS", "NLP", "MLOps", "Scikit-learn", "OpenCV"]
	},
	{
		"company": "Knowledge Foundry",
		"role": "Data Scientist",
		"start": "2018-07",
		"end": "2021-09",
		"summary": "Delivered forecasting, risk, and customer analytics solutions for global retail and insurance clients; established reusable modeling and evaluation frameworks.",
		"projects": [
			{
				"name": "Supplier Forecasting (Global Retail Chain – European Pet SKUs)",
				"bullets": [
					"Developed mid-term (1–3 month) demand forecasting solution using hierarchical time-series methods.",
					"Implemented feature engineering for seasonality, promotion effects, and supply lag dynamics.",
					"Provided accuracy dashboards and variance decomposition for supply planning stakeholders."
				],
				"impact": "Reduced forecast error by ~30% for targeted SKU groups, improving stock allocation.",
				"tech": ["Python", "Time Series Forecasting", "Pandas", "Prophet/ARIMA", "Visualization"]
			},
			{
				"name": "Predictive Analytics for South African Insurer",
				"bullets": [
					"Built AWS-based ML pipeline to predict policy default and early cancellation behavior.",
					"Engineered risk segmentation features (payment history, interaction intensity, coverage complexity).",
					"Delivered intervention scoring framework for retention workflows.",
					"Collaborated with business teams to embed model outputs into decision routines."
				],
				"impact": "Reduced defaults by ~20% and NTU (Not-Taken-Up) by ~15%, driving measurable retention uplift.",
				"tech": ["Python", "AWS", "ML Pipelines", "Risk Modeling"]
			}
		],
		"tech": ["Python", "Forecasting", "Risk Modeling", "AWS", "Feature Engineering", "Analytics"]
	}
]